Revit 2027 API
BuiltInFailures.RevolutionFailures.CannotDrawRevolution Property
 Can't create surface of revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawRevolution { get; }
Public Shared ReadOnly Property CannotDrawRevolution As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawRevolution {
	FailureDefinitionId^ get ();
}
static member CannotDrawRevolution : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevolutionFailures Class
Autodesk.Revit.DB Namespace